Информационная_база_КанцОптТорг/src/BusinessProcesses/ТестированиеКандидата/ТестированиеКандидата.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:BusinessProcess>
  <name>ТестированиеКандидата</name>
  <task>Task.ЗадачаТестированияКандидата</task>
  <attributes>
    <name>ФИО</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>80</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Возраст</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>2</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ПройденТестАдминистрирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПройденТестПрограммирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ПредложеннаяВакансия</name>
    <type>
      <types>EnumRef.Вакании</types>
    </type>
  </attributes>
</mdclass:BusinessProcess>

Информационная_база_КанцОптТорг/src/Enums/Вакании/Вакании.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>Вакании</name>
  <enumValues>
    <name>Оператор1С</name>
  </enumValues>
  <enumValues>
    <name>Администратор1С</name>
  </enumValues>
  <enumValues>
    <name>Программист1С</name>
  </enumValues>
</mdclass:Enum>

Информационная_база_КанцОптТорг/src/BusinessProcesses/ТестированиеКандидата/ObjectModule.bsl
Процедура ПройденТестАдминистрированиеПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	                                       
	   Результат = ПройденТестАдминистрирование;
	
КонецПроцедуры

Процедура ПройденТестПрограммированиеПроверкаУсловия(ТочкаМаршрутаБизнесПроцесса, Результат)
	
       Результат = ПройденТестПрограммирование;
	
КонецПроцедуры

Процедура ВакагсияОператор1СПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
    ПредложеннаяВакансия = Перечисления.Вакании.Оператор1С;
	
КонецПроцедуры

Процедура ВакансияАдминистраторПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	ПредложеннаяВакансия = Перечисления.Вакании.Администратор1С;

КонецПроцедуры

Процедура ВакансияПрограммистПриВыполнении(ТочкаМаршрутаБизнесПроцесса, Задача, Отказ)
	
	ПредложеннаяВакансия = Перечисления.Вакании.Программист1С;

КонецПроцедуры
